app/controllers/articles_controller.rb

   def create
    #render plain: params[ :article ].inspect
      @article = Article.new( article_params ) ;
      if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "t"], ["text", "a"], ["created_at", "2015-10-12 01:52:18.034587"], ["updated_at", "2015-10-12 01:52:18.034587"]]